tutorials/compressible/rhoCentralFoam/biconic25-55Run35/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 0.1)
    (1 0 0.1)
    (1 1 0.1)
    (0 1 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (255 127  1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    cone
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    freestream
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }

    centreLeft
    {
        type symmetry;
        faces
        (
            (0 4 7 3)
        );
    }

    wedge1
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }

    wedge2
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
